post/vo-ghi-chung/index.html
<!DOCTYPE html>
<html lang="vi-vn">
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <title> Viết ghi chú mỗi ngày làm việc | MẤY KHI MẤY KHỈ</title>
  
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="robots" content="all,follow">
  <meta name="googlebot" content="index,follow,snippet,archive">
  <meta property="og:title" content="Viết ghi chú mỗi ngày làm việc" />
<meta property="og:description" content="Khi còn là sinh viên mình cũng vọc vạch kha khá, kinh nghiệm đọng lại rồi cũng rơi dần nếu không dùng lại, ngay cả những cái đơn giản nhất. Mình bắt đầu suy nghĩ về việc viết note như là mình hồi xưa đi học để lại các kiến thức trong vở. (Nhưng vở thì mình cũng vứt lâu rồi)
 Thế là mình bắt đầu làm nó bài bản hơn." />
<meta property="og:type" content="article" />
<meta property="og:url" content="/post/vo-ghi-chung/" />
<meta property="article:published_time" content="2021-03-07T15:07:16+07:00" />
<meta property="article:modified_time" content="2021-03-07T15:07:16+07:00" />

  <meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Viết ghi chú mỗi ngày làm việc"/>
<meta name="twitter:description" content="Khi còn là sinh viên mình cũng vọc vạch kha khá, kinh nghiệm đọng lại rồi cũng rơi dần nếu không dùng lại, ngay cả những cái đơn giản nhất. Mình bắt đầu suy nghĩ về việc viết note như là mình hồi xưa đi học để lại các kiến thức trong vở. (Nhưng vở thì mình cũng vứt lâu rồi)
 Thế là mình bắt đầu làm nó bài bản hơn."/>

  
  
    
  
  
  <link rel="stylesheet" href="/css/style-light.css">
  
  
  
    <!--[if lt IE 9]>
    <![endif]-->
  

  
<link rel="icon" type="image/png" href="/images/favicon.ico" />

  
  
</head>

<body class="max-width mx-auto px3 ltr">
  <div class="content index py4">

    <header id="header">
  <a href="/">
  
    <div id="logo" style="background-image: url(https://avatars.githubusercontent.com/u/9713793?s=64)"></div>
  
  <div id="title">
    <h1>MẤY KHI MẤY KHỈ</h1>
  </div>
  </a>
  <div id="nav">
    <ul>
      <li class="icon">
        <a href="#"><i class="fas fa-bars fa-2x"></i></a>
      </li>
      
        <li><a href="/post/intro">Intro</a></li>
      
        <li><a href="/post">Writings</a></li>
      
    </ul>
  </div>
</header>



    
<article class="post" itemscope itemtype="http://schema.org/BlogPosting">

  <div class="content" itemprop="articleBody">
  
    
<p>
Khi còn là sinh viên mình cũng vọc vạch kha khá, kinh nghiệm đọng lại rồi cũng rơi dần nếu không dùng lại, ngay cả những cái đơn giản nhất.
Mình bắt đầu suy nghĩ về việc viết note như là mình hồi xưa đi học để lại các kiến thức trong vở. (Nhưng vở thì mình cũng vứt lâu rồi)</p>
<p>
Thế là mình bắt đầu làm nó bài bản hơn. Như 1 cuốn vở ghi chung. Mình cần</p>
<ul>
<li>
<p>Git cả thư mục viết note đó lên 1 gitlab/github (private)</p>
</li>
<li>
<p>Mình sẽ note theo các topic là các folder cho dễ tìm. Kiểu structure 1 chút</p>
</li>
<li>
<p>Để tìm 1 note thì mình sẽ tìm theo 2 cách tìm theo file và tìm theo pattern. (dùng find và grep)</p>
</li>
<li>
<p>Viết anything có thể note được. Ví dụ mình cho cả đống config về cái gì đó lên luôn, chả sao.</p>
</li>
<li>
<p>Hỗ trợ cả encrypt bằng GnuPG</p>
</li>
</ul>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Bắt đầu
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
  Từ cái đó mình đã viết ra 1 cái tool là <a href="https://github.com/txgvnn/gxt">gxt</a> (vâng, mình tự sướng bằng tên của mình. Haha)
  Tool này rất tiện cho mình note mọi thứ, và cả share note nhanh chóng nữa. Support `gpg` luôn</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Bây giờ
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>Giờ thì ngày nào mình cũng viết vào <code>note</code> nếu mình ngồi vào máy tính. Mình đưa cả dotfiles của mình vào, nên ngày nào cũng cập nhật. LOL</p>
<p>
  Bây giờ <span class="timestamp">&lt;2021-03-07 Sun&gt;</span>, mình đang có:</p>
<ul>
<li>
<p>1914 files</p>
</li>
<li>
<p>3396 commits</p>
</li>
<li>
<p>Ngày commit đầu tiên là <code>2015-09-22</code></p>
</li>
</ul>
<p>Hôì đó mình đang dùng Vim, chưa dùng Emacs.
  Sau này chuyển qua sống trong Emacs thì mình không còn dùng <code>gxt</code> nhiều trên máy tính của mình nữa.
  Nhưng tool này vẫn hữu dụng trên điện thoại cuả mình. Vì mình sử dụng <a href="https://termux.com">Termux</a> trên điện thoại nên dùng <code>gxt</code> để tìm kiếm note rất tiện.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Mình thấy
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
  Nhảy việc ở vài công ty nhưng mình thấy mọi người THƯỜNG KHÔNG hay viết note, có viết thì cũng chỉ viết tạm vào 1 cái file, hay folder. Rồi họ cài lại máy hay di chuyển công ty thì các tệp đó đều mất hoặc backup vào chỗ nào đó mà chả bao giờ họ mở lại.</p>
<p>
  Vì thế với vở ghi chung, mình lấy ví dụ:</p>
<ul>
<li>
<p>gặp 1 cái bug, rồi mình note lại. Bữa sau thì cứ thế mà áp dụng.</p>
</li>
<li>
<p>note lại cách chạy 1 cái lệnh gì đó.</p>
</li>
<li>
<p>note lại cả config nào đó, bữa sau đối chiếu</p>
</li>
<li>
<p>note lại cách viết note</p>
</li>
</ul>
<p>Giờ mình còn có thể xem lại hôì làm ở công ty X, mình đã làm về cái gì. Vì mình đều ghi lại khá khá</p>
</div>
</div>

  
  </div>
</article>


    <footer id="footer">
  <div class="footer-left">
    Copyright  &copy; 2024  MẤY KHI MẤY KHỈ 
  </div>
  <div class="footer-right">
    <nav>
      <ul>
         
        <li><a href="/post/intro">Intro</a></li>
         
        <li><a href="/post">Writings</a></li>
        
      </ul>
    </nav>
  </div>
</footer>


  </div>
</body>

<link rel="stylesheet" href=/lib/font-awesome/css/all.min.css>
<script src=/lib/jquery/jquery.min.js></script>
<script src=/js/main.js></script>
</html>
